tap "valkyrie00/bbrew", "https://github.com/Valkyrie00/homebrew-bbrew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Multi-shell multi-command argument completer
brew "carapace"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# .NET Core
brew "dotnet"
# More intuitive version of du in rust
brew "dust"
# Linux utility to get information on filesystems, like df but better
brew "dysk"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full", link: true
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Tool to convert a Wallpaper's color scheme / palette
brew "gowall"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full", link: true
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Provides unified data access to the GNOME project
brew "libgda"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Fast and user friendly build system
brew "meson"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Modern shell for the GitHub era
brew "nushell"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# General purpose fuzzy finder TUI
brew "television"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Parser generator tool
brew "tree-sitter-cli"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Compression and file packaging/archive utility
brew "zip"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Modern TUI for managing Homebrew packages and casks on macOS and Linux
brew "valkyrie00/bbrew/bbrew", trusted: true
# Terminal-based AI coding assistant
cask "claude-code"
cask "font-symbols-only-nerd-font"
cargo "gnomad"
cargo "tinty"
flatpak "app.zen_browser.zen"
flatpak "ca.desrt.dconf-editor"
flatpak "com.dec05eba.gpu_screen_recorder"
flatpak "com.github.Matoking.protontricks"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.mattjakeman.ExtensionManager"
flatpak "com.ranfdev.DistroShelf"
flatpak "com.stremio.Stremio"
flatpak "com.usebottles.bottles"
flatpak "com.vysp3r.ProtonPlus"
flatpak "dev.vencord.Vesktop"
flatpak "io.github.Foldex.AdwSteamGtk"
flatpak "io.github.bhack.mini-eq"
flatpak "io.github.flattool.Ignition"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.ilya_zlobintsev.LACT"
flatpak "io.github.nokse22.high-tide"
flatpak "io.github.pwr_solaar.solaar"
flatpak "io.github.tanaybhomia.Whisp"
flatpak "io.missioncenter.MissionCenter"
flatpak "io.mpv.Mpv"
flatpak "it.mijorus.gearlever"
flatpak "net.pcsx2.PCSX2"
flatpak "org.DolphinEmu.dolphin-emu"
flatpak "org.fedoraproject.MediaWriter"
flatpak "org.gnome.Boxes"
flatpak "org.gnome.Calculator"
flatpak "org.gnome.Calendar"
flatpak "org.gnome.Characters"
flatpak "org.gnome.Contacts"
flatpak "org.gnome.Firmware"
flatpak "org.gnome.Logs"
flatpak "org.gnome.Loupe"
flatpak "org.gnome.NautilusPreviewer"
flatpak "org.gnome.Papers"
flatpak "org.gnome.Showtime"
flatpak "org.gnome.TextEditor"
flatpak "org.gnome.Weather"
flatpak "org.gnome.baobab"
flatpak "org.gnome.clocks"
flatpak "org.gnome.font-viewer"
flatpak "org.mozilla.firefox"
flatpak "page.tesk.Refine"
